"""""
Створити рядок з Вашим прізвищем, ім’ям та по-батькові (наприклад,
“Руденко Іван Семенович”). З використанням методів та функцій рядків
Python вивести
 довжину цього рядка і кількість пробілів у ньому;
 ім’я та прізвище (для прикладу, Іван Руденко);
 Ваші ініціали (для цього прикладу: РІС);
 Зробити усі літери прописними;
 Вставити в цей рядок в кінець кому та дату Вашого народження в
форматі YYYY.MM.DD
"""

full_name = "Литвиненко Олексій Андрійович"
birth_date = "2006.06.10"

# Довжина рядка і кількість пробілів
length = len(full_name)
spaces_count = full_name.count(' ')
print(f"Довжина рядка: {length}, кількість пробілів: {spaces_count}")

# ім'я та прізвище
name_parts = full_name.split() # Розбиваємо рядок на список слів
name_surname = f"{name_parts[1]} {name_parts[0]}"
print(f"Ім'я та прізвище: {name_surname}")

# Ініціали (перші літери кожного слова)
initials = f"{name_parts[0][0]}{name_parts[1][0]}{name_parts[2][0]}"
print(f"Ініціали: {initials}")

# зробити усі літери прописними (великими)
upper_name = full_name.upper()
print(f"Усі великі літери: {upper_name}")

# вставити в кінець кому та дату народження
final_string = f"{full_name}, {birth_date}"
print(f"Рядок з датою: {final_string}")