"""

Сформувати список з list_5 із 12 елементів: 8 цілих чисел та 4-х рядків.
На основі цього списку створити інший список list_6 з 8 числових
елементів, в якому кожен елемент дорівнює середньоарифметичному усіх
наступних числових елементів списку list_5 (з точністю до двох знаків).

"""

list_5 = [1, 1, "ASbvsxT", 2, 4, "A", -1, "qq", 7, 2, 0, "qweT"]
print("початковий list_5:", list_5)

# виокремлюємо всі числові елементи зі списку
nums = [x for x in list_5 if isinstance(x, (int, float))]

# формування list_6 (середнє арифметичне всіх наступних числових елементів, включаючи поточний)
list_6 = []
for i in range(len(nums)):
    subsequent_nums = nums[i:]  # беремо зріз від поточного елемента до кінця
    avg = sum(subsequent_nums) / len(subsequent_nums)
    list_6.append(round(avg, 2))

print("список list_6 (середнє арифметичне):", list_6)

# створення списку рядків з довжиною більше 2
strings_gt_2 = [x for x in list_5 if isinstance(x, str) and len(x) > 2]
print("рядки з довжиною більше 2:", strings_gt_2)