"""
Для рядка
“ Don't worry, it's a piece of cake, there will be no problem! Choose a
job you love, and you will never have to work a day in your life!!! ’
із використанням індексів та слайсів
 вивести перші 5 символів;
 останні 10 символів;
 всі символи, починаючи з 10-го і до кінця;
 всі символи, починаючи з 4-го і до передостаннього із кроком 3;
 всі символи у зворотному порядку (починаючи із кінця)
"""

quote = " Don't worry, it's a piece of cake, there will be no problem! Choose a job you love, and you will never have to work a day in your life!!! "

# перші 5 символів
print(f"Перші 5 символів: '{quote[:5]}'")

# останні 10 символів
print(f"Останні 10 символів: '{quote[-10:]}'")

# всі символи, починаючи з 10-го і до кінця (10-й символ має індекс 9)
print(f"З 10-го до кінця: '{quote[9:]}'")

# з 4-го до передостаннього із кроком 3
# (4-й символ: індекс 3, передостанній: індекс -1)
print(f"З 4-го до передостаннього з кроком 3: '{quote[3:-1:3]}'")

# всі символи у зворотному порядку
print(f"У зворотному порядку: '{quote[::-1]}'")