number = 123
print(f"Вихідне число: {number}")

# перетворюємо число на рядок для маніпуляцій
str_num = str(number)

# п. 2.2 закреслити першу зліва цифру і приписати її справа
new_str_22 = str_num[1:] + str_num[0]
result_22 = int(new_str_22) # Перетворюємо назад на число
print(f"П. 2.2 (Перша цифра йде в кінець): {result_22}")

# п. 2.4 Перестановка цифр сотень і десятків (перша і друга цифра)
new_str_24 = str_num[1] + str_num[0] + str_num[2]
result_24 = int(new_str_24) # Перетворюємо назад на число
print(f"П. 2.4 (Сотні і десятки міняються місцями): {result_24}")