"""
Для рядка визначити
” https://istories.media/workshops/2020/11/11/vvedenie-v-python-chast-
2-stroki/ ”
 чи складається рядок із цифр;
 чи складається рядок із цифр або букв;
 чи складається рядок із символів у нижньому регістрі;
 чи складається рядок із символів, що не відображаються;
 чи містить цей рядок підрядок “11”
"""

url = "https://istories.media/workshops/2020/11/11/vvedenie-v-python-chast-2-stroki/"

# перевірки за допомогою вбудованих методів рядків
print(f"Чи складається рядок ТІЛЬКИ із цифр? -> {url.isdigit()}")
print(f"Чи складається рядок ТІЛЬКИ із цифр або букв (без символів / , -)? -> {url.isalnum()}")
print(f"Чи складається рядок ТІЛЬКИ із символів у нижньому регістрі? -> {url.islower()}")
print(f"Чи складається рядок ТІЛЬКИ із символів, що не відображаються (пробіли, таби)? -> {url.isspace()}")

# перевірка на наявність підрядка "11"
contains_11 = "11" in url
print(f"Чи містить цей рядок підрядок '11'? -> {contains_11}")