"""

Сформувати список list_1 із цілих чисел із діапазону [0 ,20] із кроком 2
із використанням функції range() та конструктора list(). Виконати такі дії
 вивести елементи з непарними індексами;
 вивести елементи з початку і до 5-го включно, з 3-го і до
передостаннього включно з кроком 2;
 вивести елементи списку у зворотному порядку із використанням
слайдів та із використанням методів списків;
 поміняти місцями перший та останній елементи списку із
використанням індексів та із використанням методів списків;
 перевірити, чи є число 0 у списку

"""


# формуємо список із цілих чисел [0, 20] із кроком 2
list_1 = list(range(0, 21, 2))
print(f"початковий list_1: {list_1}")

# виводимо елементи з непарними індексами (починаючи з індексу 1, крок 2)
print(f"непарні індекси: {list_1[1::2]}")

# виводимо елементи з початку і до 5-го включно (індекси від 0 до 5, тому зріз до 6)
print(f"до 5-го включно: {list_1[:6]}")

# з 3-го і до передостаннього включно з кроком 2 (3-й елемент має індекс 2)
print(f"з 3-го до передостаннього з кроком 2: {list_1[2:-1:2]}")

# виводимо список у зворотному порядку
print(f"зворотний порядок (слайси): {list_1[::-1]}")

# виводимо список у зворотному порядку
list_1_rev = list_1.copy()
list_1_rev.reverse()
print(f"зворотний порядок (метод): {list_1_rev}")

# міняємо місцями перший та останній (
list_1_swap1 = list_1.copy()
list_1_swap1[0], list_1_swap1[-1] = list_1_swap1[-1], list_1_swap1[0]
print(f"обмін (індекси): {list_1_swap1}")

# міняємо місцями перший та останній
list_1_swap2 = list_1.copy()
first_el = list_1_swap2.pop(0)
last_el = list_1_swap2.pop(-1)
list_1_swap2.insert(0, last_el)
list_1_swap2.append(first_el)
print(f"обмін (методи): {list_1_swap2}")

# перевіряємо, число 0 у списку
has_zero = 0 in list_1
print(f"чи є 0 у списку: {has_zero}")